Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/******************************************************************************
 *                                                                          
 * Copyright (c) 2008 Nuvoton Technology. All rights reserved.             
 *                                                                         
 * FILENAME
 *     NUC900_reg.h
 *
 * VERSION
 *     1.0
 *
 * DESCRIPTION
 *     This file contains the general register map of Nuvoton NUC900 processor. 
 *     Some registers are not defined for specific processor.
 *     
 *
 * HISTORY
 *     2008-06-19	Ver 1.0 Created by Min-Nan Cheng
 *
 * REMARK
 *     None
 *     
 ******************************************************************************/
#ifndef _NUC900_H
#define _NUC900_H


/*
   Register map
*/
#define    GCR_BA    0xB0000000 /* Global Control */
#define    CLK_BA    0xB0000200 /* Clock Control */
#define    EBI_BA    0xB0001000 /* EBI Control */
#define    PCI_BA    0xB0002000 /* PCI Control */
#define    EMC_BA    0xB0003000 /* Ethernet MAC */
#define    GDMA_BA   0xB0004000 /* GDMA control */
#define    USBH_BA   0xB0005000 /* USB Host Control */
#define    USBD_BA   0xB0006000 /* USB Device Control */
#define    USBO_BA   0xB0007000 /* OHCI USH Control */
#define    LCM_BA    0xB0008000 /* Display, LCM Interface */
#define    ACTL_BA   0xB0009000 /* Audio Control */
#define    ATA_BA    0xB000A000 /* ATA Interface Control */
#define    GE_BA     0xB000B000 /* 2-D Graphic Engine */
#define    DMAC_BA   0xB000C000 /* DMA Control */
#define    FMI_BA    0xB000D000 /* Flash Memory Card Interface */
#define    UART0_BA  0xB8000000 /* UART0 Control (console) */
#define    UART1_BA  0xB8000100 /* UART1 Control (Bluetooth) */
#define    UART2_BA  0xB8000200 /* UART2 Control (IrDA) */
#define    UART3_BA  0xB8000300 /* UART3 Control (micro-printer) */
#define    UART4_BA  0xB8000400 /* UART4 Control (console) */
#define    TMR_BA    0xB8001000 /* Timer */
#define    AIC_BA    0xB8002000 /* Interrupt Controller */
#define    GPIO_BA   0xB8003000 /* GPIO Control */
#define    RTC_BA    0xB8004000 /* Real Time Clock Control */
#define    SC_BA     0xB8005000 /* Smart Card Control */
#define    I2C0_BA   0xB8006000 /* I2C 0 Control */
#define    I2C1_BA   0xB8006100 /* I2C 1 Control */
#define    USI_BA    0xB8006200 /* Universal Serial Interface */
#define    PWM_BA    0xB8007000 /* Pulse Width Modulation (PWM) Control */
#define    KPI_BA    0xB8008000 /* Keypad Interface Control */
#define    PS2_BA    0xB8009000 /* PS2 Interface Control */
#define    ADC_BA    0xB800A000 /* ADC Control */

 
/*                                                             
  Global Control Registers  
*/
#define    REG_PDID     	(GCR_BA+0x000)  /* Product Identifier Register */
#define    REG_PWRON		(GCR_BA+0x004)  /* Power-On Setting Register */
#define    REG_ARBCON		(GCR_BA+0x008)  /* Arbitration Control Register */
#define    REG_MFSEL		(GCR_BA+0x00C)  /* Multiple Function Pin Select Register */
#define    REG_EBIDPE   	(GCR_BA+0x010)  /* EBI Data Pin Pull-up/down Enable Register */
#define    REG_LCDDPE   	(GCR_BA+0x014)  /* LCD Data Pin Pull-up/down Enable Register */
#define    REG_GPIOCPE  	(GCR_BA+0x018)  /* GPIOC Pin Pull-up/down Enable Register */
#define    REG_GPIODPE  	(GCR_BA+0x01C)  /* GPIOD Pin Pull-up/down Enable Register */
#define    REG_GPIOEPE 		(GCR_BA+0x020)  /* GPIOE Pin Pull-up/down Enable Register */
#define    REG_GPIOFPE  	(GCR_BA+0x024)  /* GPIOF Pin Pull-up/down Enable Register */
#define    REG_GPIOGPE  	(GCR_BA+0x028)  /* GPIOG Pin Pull-up/down Enable Register */
#define    REG_GPIOHPE  	(GCR_BA+0x02C)  /* GPIOH Pin Pull-up/down Enable Register */
#define    REG_GPIOIPE  	(GCR_BA+0x030)  /* GPIOI Pin Pull-up/down Enable Register */
#define    REG_GTMP1    	(GCR_BA+0x034)  /* General Temporary Register 1 */
#define    REG_GTMP2    	(GCR_BA+0x038)  /* General Temporary Register 2 */
#define    REG_GTMP3   		(GCR_BA+0x03C)  /* General Temporary Register 3 */

#define    rPDID			(*(unsigned int volatile *)REG_PDID)
#define    rPWRON			(*(unsigned int volatile *)REG_PWRON)
#define    rARBCON			(*(unsigned int volatile *)REG_ARBCON)
#define    rMFSEL			(*(unsigned int volatile *)REG_MFSEL)
#define    rEBIDPE   		(*(unsigned int volatile *)REG_EBIDPE)
#define    rLCDDPE   		(*(unsigned int volatile *)REG_LCDDPE)
#define    rGPIOCPE  		(*(unsigned int volatile *)REG_GPIOCPE)
#define    rGPIODPE  		(*(unsigned int volatile *)REG_GPIODPE)
#define    rGPIOEPE  		(*(unsigned int volatile *)REG_GPIOEPE)
#define    rGPIOFPE  		(*(unsigned int volatile *)REG_GPIOFPE)
#define    rGPIOGPE  		(*(unsigned int volatile *)REG_GPIOGPE)
#define    rGPIOHPE  		(*(unsigned int volatile *)REG_GPIOHPE)
#define    rGPIOIPE  		(*(unsigned int volatile *)REG_GPIOIPE)
#define    rGTMP1    		(*(unsigned int volatile *)REG_GTMP1)
#define    rGTMP2    		(*(unsigned int volatile *)REG_GTMP2)
#define    rGTMP3    		(*(unsigned int volatile *)REG_GTMP3)


/*                                                            
  Clock Control Registers  
*/
#define    REG_CLKEN		(CLK_BA+0x00) /* Clock Enable Register */
#define    REG_CLKSEL		(CLK_BA+0x04) /* Clock Select Register */
#define    REG_CLKDIV		(CLK_BA+0x08) /* Clock Divider Control Register */
#define    REG_PLLCON0		(CLK_BA+0x0C) /* PLL Control Register 0 */
#define    REG_PLLCON1		(CLK_BA+0x10) /* PLL Control Register 1 */
#define    REG_PMCON		(CLK_BA+0x14) /* Power Management Control Register */
#define    REG_IRQWAKECON	(CLK_BA+0x18) /* IRQ Wakeup Control Register */
#define    REG_IRQWAKEFLAG	(CLK_BA+0x1C) /* IRQ Wakeup Flag Register */
#define    REG_IPSRST		(CLK_BA+0x20) /* IP Software Reset Register */
#define    REG_CLKEN1		(CLK_BA+0x24) /* Clock Enable Register 1 */
#define    REG_CLKDIV1		(CLK_BA+0x28) /* Clock Divider Control Register 1 */

#define    rCLKEN			(*(unsigned int volatile *)REG_CLKEN)
#define    rCLKSEL			(*(unsigned int volatile *)REG_CLKSEL)
#define    rCLKDIV			(*(unsigned int volatile *)REG_CLKDIV)
#define    rPLLCON0			(*(unsigned int volatile *)REG_PLLCON0)
#define    rPLLCON1			(*(unsigned int volatile *)REG_PLLCON1)
#define    rPMCON			(*(unsigned int volatile *)REG_PMCON)
#define    rIRQWAKECON		(*(unsigned int volatile *)REG_IRQWAKECON)
#define    rIRQWAKEFLAG		(*(unsigned int volatile *)REG_IRQWAKEFLAG)
#define    rIPSRST			(*(unsigned int volatile *)REG_IPSRST)
#define    rCLKEN1			(*(unsigned int volatile *)REG_CLKEN1)
#define    rCLKDIV1			(*(unsigned int volatile *)REG_CLKDIV1)

