Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/*
  EBI Control Registers  
*/
#define    REG_EBICON		(EBI_BA+0x000)  /* EBI control register */
#define    REG_ROMCON		(EBI_BA+0x004)  /* ROM/FLASH control register */
#define    REG_SDCONF0		(EBI_BA+0x008)  /* SDRAM bank 0 configuration register */
#define    REG_SDCONF1		(EBI_BA+0x00C)  /* SDRAM bank 1 configuration register */
#define    REG_SDTIME0		(EBI_BA+0x010)  /* SDRAM bank 0 timing control register */
#define    REG_SDTIME1		(EBI_BA+0x014)  /* SDRAM bank 1 timing control register */
#define    REG_EXT0CON		(EBI_BA+0x018)  /* External I/O 0 control register */
#define    REG_EXT1CON		(EBI_BA+0x01C)  /* External I/O 1 control register */
#define    REG_EXT2CON		(EBI_BA+0x020)  /* External I/O 2 control register */
#define    REG_EXT3CON		(EBI_BA+0x024)  /* External I/O 3 control register */
#define    REG_EXT4CON		(EBI_BA+0x028)  /* External I/O 4 control register */
#define    REG_CKSKEW		(EBI_BA+0x02C)  /* Clock skew control register */

#define    rEBICON			(*(unsigned int volatile *)REG_EBICON)
#define    rROMCON			(*(unsigned int volatile *)REG_ROMCON)
#define    rSDCONF0			(*(unsigned int volatile *)REG_SDCONF0)
#define    rSDCONF1			(*(unsigned int volatile *)REG_SDCONF1)
#define    rSDTIME0			(*(unsigned int volatile *)REG_SDTIME0)
#define    rSDTIME1			(*(unsigned int volatile *)REG_SDTIME1)
#define    rEXT0CON			(*(unsigned int volatile *)REG_EXT1CON)
#define    rEXT2CON			(*(unsigned int volatile *)REG_EXT2CON)
#define    rEXT3CON			(*(unsigned int volatile *)REG_EXT3CON)
#define    rEXT4CON			(*(unsigned int volatile *)REG_EXT4CON)
#define    rCKSKEW			(*(unsigned int volatile *)REG_CKSKEW)


/*                                                              
 PCI Control Registers  
*/
#define REG_PCICTR			(PCI_BA + 0x000)    /* PCI Control Register */
#define REG_PCISTR			(PCI_BA + 0x004)    /* PCI Status Register */
#define REG_PCILATIMER		(PCI_BA + 0x008)    /* PCI Latency Timer Register */
#define REG_PCIINTEN		(PCI_BA + 0x010)    /* PCI Interrupt Enable Register */
#define REG_PCIINT			(PCI_BA + 0x014)    /* PCI Interrupt Flag Register */
#define REG_CFGADDR			(PCI_BA + 0x020)    /* Configuration Address Register */
#define REG_CFGDATA			(PCI_BA + 0x024)    /* Configuration Data Register */
#define REG_PCIARB			(PCI_BA + 0x04C)    /* PCI Arbitration Register */
#define REG_PCIBIST			(PCI_BA + 0x050)    /* PCI FIFO BIST Register */

#define rPCICTR				(*(unsigned int volatile *)REG_PCICTR)
#define rPCISTR				(*(unsigned int volatile *)REG_PCISTR)
#define rPCILATIMER			(*(unsigned int volatile *)REG_PCILATIMER)
#define rPCIINTEN			(*(unsigned int volatile *)REG_PCIINTEN)
#define rPCIINT				(*(unsigned int volatile *)REG_PCIINT)
#define rCFGADDR			(*(unsigned int volatile *)REG_CFGADDR)
#define rCFGDATA			(*(unsigned int volatile *)REG_CFGDATA)
#define rPCIARB				(*(unsigned int volatile *)REG_PCIARB)
#define rPCIBIST			(*(unsigned int volatile *)REG_PCIBIST)


/*
  EMAC Registers
*/
#define     REG_CAMCMR		(EMC_BA+0x000)	/* CAM Command Register */
#define     REG_CAMEN		(EMC_BA+0x004)	/* CAM Enable Register */
#define     REG_CAM0M_Base	(EMC_BA+0x008)  /* CAM0 Most Significant Word Register */
#define     REG_CAM0L_Base	(EMC_BA+0x00c)  /* CAM0 Least Significant Word Register */
#define     REG_CAMxM_Reg(x)(REG_CAM0M_Base+x*0x8)	/* CAMx Most Significant Word Register */
#define     REG_CAMxL_Reg(x)(REG_CAM0L_Base+x*0x8)	/* CAMx Least Significant Word Register */
#define     REG_TXDLSA		(EMC_BA+0x088)	/* Transmit Descriptor Link List Start Address Register */
#define     REG_RXDLSA		(EMC_BA+0x08C)	/* Receive Descriptor Link List Start Address Register */
#define     REG_MCMDR		(EMC_BA+0x090)	/* MAC Command Register */
#define     REG_MIID		(EMC_BA+0x094)	/* MII Management Data Register */
#define     REG_MIIDA		(EMC_BA+0x098)	/* MII Management Control and Address Register */
#define     REG_FFTCR		(EMC_BA+0x09C)	/* FIFO Threshold Control Register */
#define     REG_TSDR		(EMC_BA+0x0a0)	/* Transmit Start Demand Register */
#define     REG_RSDR		(EMC_BA+0x0a4)	/* Receive Start Demand Register */
#define     REG_DMARFC		(EMC_BA+0x0a8)	/* Maximum Receive Frame Control Register */
#define     REG_MIEN		(EMC_BA+0x0ac)	/* MAC Interrupt Enable Register */
#define     REG_MISTA		(EMC_BA+0x0b0)	/* MAC Interrupt Status Register */
#define     REG_MGSTA		(EMC_BA+0x0b4)	/* MAC General Status Register */
#define     REG_MPCNT		(EMC_BA+0x0b8)	/* Missed Packet Count Register */
#define     REG_MRPC		(EMC_BA+0x0bc)	/* MAC Receive Pause Count Register */
#define     REG_MRPCC		(EMC_BA+0x0c0)	/* MAC Receive Pause Current Count Register */
#define     REG_MREPC		(EMC_BA+0x0c4)	/* MAC Remote Pause Count Register */
#define     REG_DMARFS		(EMC_BA+0x0c8)	/* DMA Receive Frame Status Register */
#define     REG_CTXDSA		(EMC_BA+0x0cc)	/* Current Transmit Descriptor Start Address Register */
#define     REG_CTXBSA		(EMC_BA+0x0d0)	/* Current Transmit Buffer Start Address Register */
#define     REG_CRXDSA		(EMC_BA+0x0d4)	/* Current Receive Descriptor Start Address Register */
#define     REG_CRXBSA		(EMC_BA+0x0d8)	/* Current Receive Buffer Start Address Register */
	
#define     rCAMCMR			(*(unsigned int volatile *)REG_CAMCMR)
#define     rCAMEN			(*(unsigned int volatile *)REG_CAMEN)
#define     rCAM0M_Base		(*(unsigned int volatile *)REG_CAM0M_Base)
#define     rCAM0L_Base		(*(unsigned int volatile *)REG_CAM0L_Base)
#define     rCAMxM_Reg(x)	(*(unsigned int volatile *)(REG_CAM0M_Base+x*0x8))	
#define     rCAMxL_Reg(x)	(*(unsigned int volatile *)(REG_CAM0L_Base+x*0x8))	
#define     rTXDLSA			(*(unsigned int volatile *)REG_TXDLSA)
#define     rRXDLSA			(*(unsigned int volatile *)REG_RXDLSA)
#define     rMCMDR			(*(unsigned int volatile *)REG_MCMDR)
#define     rMIID			(*(unsigned int volatile *)REG_MIID)
#define     rMIIDA			(*(unsigned int volatile *)REG_MIIDA)
#define     rFFTCR			(*(unsigned int volatile *)REG_FFTCR)
#define     rTSDR			(*(unsigned int volatile *)REG_TSDR)
#define     rRSDR			(*(unsigned int volatile *)REG_RSDR)
#define     rDMARFC			(*(unsigned int volatile *)REG_DMARFC)
#define     rMIEN			(*(unsigned int volatile *)REG_MIEN)
#define     rMISTA			(*(unsigned int volatile *)REG_MISTA)
#define     rMGSTA			(*(unsigned int volatile *)REG_MGSTA)
#define     rMPCNT			(*(unsigned int volatile *)REG_MPCNT)
#define     rMRPC			(*(unsigned int volatile *)REG_MRPC)
#define     rMRPCC			(*(unsigned int volatile *)REG_MRPCC)
#define     rMREPC			(*(unsigned int volatile *)REG_MREPC)
#define     rDMARFS			(*(unsigned int volatile *)REG_DMARFS)
#define     rCTXDSA			(*(unsigned int volatile *)REG_CTXDSA)
#define     rCTXBSA			(*(unsigned int volatile *)REG_CTXBSA)
#define     rCRXDSA			(*(unsigned int volatile *)REG_CRXDSA)
#define     rCRXBSA			(*(unsigned int volatile *)REG_CRXBSA)


