Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/*
USB Device Control Registers  
*/
#define     REG_USBD_IRQ_STAT		(USBD_BA+0x00)  /* interrupt status register */
#define     REG_USBD_IRQ_ENB_L		(USBD_BA+0x08)  /* interrupt enable low register */
#define     REG_USBD_USBIRQ_STAT	(USBD_BA+0x10)  /* usb interrupt status register */
#define     REG_USBD_IRQ_ENB		(USBD_BA+0x14)  /* usb interrupt enable register */
#define     REG_USBD_OPER			(USBD_BA+0x18)  /* usb operation register */
#define     REG_USBD_FRAME_CNT		(USBD_BA+0x1C)	/* usb frame count register */
#define     REG_USBD_ADDR			(USBD_BA+0x20)  /* usb address register */
#define     REG_USBD_CEP_DATA_BUF	(USBD_BA+0x28)  /* control-ep data buffer register */
#define     REG_USBD_CEP_CTRL_STAT	(USBD_BA+0x2C)  /* control-ep control and status register */
#define     REG_USBD_CEP_IRQ_ENB	(USBD_BA+0x30)  /* control-ep interrupt enable register */
#define     REG_USBD_CEP_IRQ_STAT	(USBD_BA+0x34)  /* control-ep interrupt status register */
#define     REG_USBD_IN_TRNSFR_CNT	(USBD_BA+0x38)  /* in-transfer data count register */
#define     REG_USBD_OUT_TRNSFR_CNT	(USBD_BA+0x3C)  /* out-transfer data count register */
#define     REG_USBD_CEP_CNT		(USBD_BA+0x40)  /* control-ep data count register */
#define     REG_USBD_SETUP1_0		(USBD_BA+0x44)  /* setup byte1 & byte0 register */
#define     REG_USBD_SETUP3_2		(USBD_BA+0x48)  /* setup byte3 & byte2 register */
#define     REG_USBD_SETUP5_4		(USBD_BA+0x4C)  /* setup byte5 & byte4 register */
#define     REG_USBD_SETUP7_6		(USBD_BA+0x50)  /* setup byte7 & byte6 register */
#define     REG_USBD_CEP_START_ADDR	(USBD_BA+0x54)  /* control-ep ram start address register */
#define     REG_USBD_CEP_END_ADDR	(USBD_BA+0x58)  /* control-ep ram end address register */
#define     REG_USBD_DMA_CTRL_STS	(USBD_BA+0x5C)  /* dma control and status register */
#define     REG_USBD_DMA_CNT		(USBD_BA+0x60)  /* dma count register */
#define     REG_USBD_EPA_DATA_BUF	(USBD_BA+0x64)  /* endpoint A data buffer register */
#define     REG_USBD_EPA_IRQ_STAT	(USBD_BA+0x68)  /* endpoint A interrupt status register */
#define     REG_USBD_EPA_IRQ_ENB	(USBD_BA+0x6C)  /* endpoint A interrupt enable register */
#define     REG_USBD_EPA_DATA_CNT	(USBD_BA+0x70)  /* data count available in endpoint A buffer */
#define     REG_USBD_EPA_RSP_SC		(USBD_BA+0x74)  /* endpoint A response register set/clear */
#define     REG_USBD_EPA_MPS		(USBD_BA+0x78)  /* endpoint A max packet size register */
#define     REG_USBD_EPA_TRF_CNT	(USBD_BA+0x7C)  /* endpoint A transfer count register */
#define     REG_USBD_EPA_CFG		(USBD_BA+0x80)  /* endpoint A configuration register */
#define     REG_USBD_EPA_START_ADDR	(USBD_BA+0x84)  /* endpoint A ram start address register */
#define     REG_USBD_EPA_END_ADDR	(USBD_BA+0x88)  /* endpoint A ram end address register */
#define     REG_USBD_EPB_DATA_BUF	(USBD_BA+0x8C)  /* endpoint B data buffer register */
#define     REG_USBD_EPB_IRQ_STAT	(USBD_BA+0x90)  /* endpoint B interrupt status register */
#define     REG_USBD_EPB_IRQ_ENB	(USBD_BA+0x94)  /* endpoint B interrupt enable register */
#define     REG_USBD_EPB_DATA_CNT	(USBD_BA+0x98)  /* data count available in endpoint B buffer */
#define     REG_USBD_EPB_RSP_SC		(USBD_BA+0x9C)  /* endpoint B response register set/clear */
#define     REG_USBD_EPB_MPS		(USBD_BA+0xA0)  /* endpoint B max packet size register */
#define     REG_USBD_EPB_TRF_CNT	(USBD_BA+0xA4)  /* endpoint B transfer count register */
#define     REG_USBD_EPB_CFG		(USBD_BA+0xA8)  /* endpoint B configuration register */
#define     REG_USBD_EPB_START_ADDR	(USBD_BA+0xAC)  /* endpoint B ram start address register */
#define     REG_USBD_EPB_END_ADDR	(USBD_BA+0xB0)  /* endpoint B ram end address register */
#define     REG_USBD_EPC_DATA_BUF	(USBD_BA+0xB4)  /* endpoint C data buffer register */
#define     REG_USBD_EPC_IRQ_STAT	(USBD_BA+0xB8)  /* endpoint C interrupt status register */
#define     REG_USBD_EPC_IRQ_ENB	(USBD_BA+0xBC)  /* endpoint C interrupt enable register */
#define     REG_USBD_EPC_DATA_CNT	(USBD_BA+0xC0)  /* data count available in endpoint C buffer */
#define     REG_USBD_EPC_RSP_SC		(USBD_BA+0xC4)  /* endpoint C response register set/clear */
#define     REG_USBD_EPC_MPS		(USBD_BA+0xC8)  /* endpoint C max packet size register */
#define     REG_USBD_EPC_TRF_CNT	(USBD_BA+0xCC)  /* endpoint C transfer count register */
#define     REG_USBD_EPC_CFG		(USBD_BA+0xD0)  /* endpoint C configuration register */
#define     REG_USBD_EPC_START_ADDR	(USBD_BA+0xD4)  /* endpoint C ram start address register */
#define     REG_USBD_EPC_END_ADDR	(USBD_BA+0xD8)  /* endpoint C ram end address register */
#define     REG_USBD_EPD_DATA_BUF	(USBD_BA+0xDC)  /* endpoint D data buffer register */
#define     REG_USBD_EPD_IRQ_STAT	(USBD_BA+0xE0)  /* endpoint D interrupt status register */
#define     REG_USBD_EPD_IRQ_ENB	(USBD_BA+0xE4)  /* endpoint D interrupt enable register */
#define     REG_USBD_EPD_DATA_CNT	(USBD_BA+0xE8)  /* data count available in endpoint D buffer */
#define     REG_USBD_EPD_RSP_SC		(USBD_BA+0xEC)  /* endpoint D response register set/clear */
#define     REG_USBD_EPD_MPS		(USBD_BA+0xF0)  /* endpoint D max packet size register */
#define     REG_USBD_EPD_TRF_CNT	(USBD_BA+0xF4)  /* endpoint D transfer count register */
#define     REG_USBD_EPD_CFG		(USBD_BA+0xF8)  /* endpoint D configuration register */
#define     REG_USBD_EPD_START_ADDR	(USBD_BA+0xFC)  /* endpoint D ram start address register */
#define     REG_USBD_EPD_END_ADDR	(USBD_BA+0x100) /* endpoint D ram end address register */
#define     REG_USBD_EPE_DATA_BUF	(USBD_BA+0x104) /* endpoint E data buffer register */
#define     REG_USBD_EPE_IRQ_STAT	(USBD_BA+0x108) /* endpoint E interrupt status register */
#define     REG_USBD_EPE_IRQ_ENB	(USBD_BA+0x10C)	/* endpoint E interrupt enable register */
#define     REG_USBD_EPE_DATA_CNT	(USBD_BA+0x110) /* data count available in endpoint E buffer */
#define     REG_USBD_EPE_RSP_SC		(USBD_BA+0x114) /* endpoint E response register set/clear */
#define     REG_USBD_EPE_MPS		(USBD_BA+0x118) /* endpoint E max packet size register */
#define     REG_USBD_EPE_TRF_CNT	(USBD_BA+0x11C) /* endpoint E transfer count register */
#define     REG_USBD_EPE_CFG		(USBD_BA+0x120) /* endpoint E configuration register */
#define     REG_USBD_EPE_START_ADDR	(USBD_BA+0x124) /* endpoint E ram start address register */
#define     REG_USBD_EPE_END_ADDR	(USBD_BA+0x128) /* endpoint E ram end address register */
#define     REG_USBD_EPF_DATA_BUF	(USBD_BA+0x12C) /* endpoint F data buffer register */
#define     REG_USBD_EPF_IRQ_STAT	(USBD_BA+0x130) /* endpoint F interrupt status register */
#define     REG_USBD_EPF_IRQ_ENB	(USBD_BA+0x134) /* endpoint F interrupt enable register */
#define     REG_USBD_EPF_DATA_CNT	(USBD_BA+0x138) /* data count available in endpoint F buffer */
#define     REG_USBD_EPF_RSP_SC		(USBD_BA+0x13C)	/* endpoint F response register set/clear */
#define     REG_USBD_EPF_MPS		(USBD_BA+0x140) /* endpoint F max packet size register */
#define     REG_USBD_EPF_TRF_CNT	(USBD_BA+0x144) /* endpoint F transfer count register */
#define     REG_USBD_EPF_CFG		(USBD_BA+0x148) /* endpoint F configuration register */
#define     REG_USBD_EPF_START_ADDR	(USBD_BA+0x14C) /* endpoint F ram start address register */
#define     REG_USBD_EPF_END_ADDR	(USBD_BA+0x150) /* endpoint F ram end address register */
#define     REG_USBD_AHB_DMA_ADDR	(USBD_BA+0x700) /* AHB_DMA address register */
#define     REG_USBD_PHY_CTL		(USBD_BA+0x704) /* USB PHY control register */


#define     rIRQ_STAT		(*(unsigned int volatile *)REG_USBD_IRQ_STAT)
#define     rIRQ_ENB_L		(*(unsigned int volatile *)REG_USBD_IRQ_ENB_L)
#define     rUSBIRQ_STAT	(*(unsigned int volatile *)REG_USBD_USBIRQ_STAT)
#define     rIRQ_ENB		(*(unsigned int volatile *)REG_USBD_IRQ_ENB)
#define     rOPER			(*(unsigned int volatile *)REG_USBD_OPER)
#define     rFRAME_CNT		(*(unsigned int volatile *)REG_USBD_FRAME_CNT)
#define     rADDR			(*(unsigned int volatile *)REG_USBD_ADDR)
#define     rCEP_DATA_BUF	(*(unsigned int volatile *)REG_USBD_CEP_DATA_BUF)
#define     rCEP_CTRL_STAT	(*(unsigned int volatile *)REG_USBD_CEP_CTRL_STAT)
#define     rCEP_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_CEP_IRQ_ENB)
#define     rCEP_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_CEP_IRQ_STAT)
#define     rIN_TRNSFR_CNT	(*(unsigned int volatile *)REG_USBD_IN_TRNSFR_CNT)
#define     rOUT_TRNSFR_CNT	(*(unsigned int volatile *)REG_USBD_OUT_TRNSFR_CNT)
#define     rCEP_CNT		(*(unsigned int volatile *)REG_USBD_CEP_CNT)
#define     rSETUP1_0		(*(unsigned int volatile *)REG_USBD_SETUP1_0)
#define     rSETUP3_2		(*(unsigned int volatile *)REG_USBD_SETUP3_2)
#define     rSETUP5_4		(*(unsigned int volatile *)REG_USBD_SETUP5_4)
#define     rSETUP7_6		(*(unsigned int volatile *)REG_USBD_SETUP7_6)
#define     rCEP_START_ADDR	(*(unsigned int volatile *)REG_USBD_CEP_START_ADDR)
#define     rCEP_END_ADDR	(*(unsigned int volatile *)REG_USBD_CEP_END_ADDR)
#define     rDMA_CTRL_STS	(*(unsigned int volatile *)REG_USBD_DMA_CTRL_STS)
#define     rDMA_CNT		(*(unsigned int volatile *)REG_USBD_DMA_CNT)
#define     rEPA_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPA_DATA_BUF)
#define     rEPA_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPA_IRQ_STAT)
#define     rEPA_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPA_IRQ_ENB)
#define     rEPA_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPA_DATA_CNT)
#define     rEPA_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPA_RSP_SC)
#define     rEPA_MPS		(*(unsigned int volatile *)REG_USBD_EPA_MPS)
#define     rEPA_TRF_CNT	(*(unsigned int volatile *)REG_USBD_EPA_TRF_CNT)
#define     rEPA_CFG		(*(unsigned int volatile *)REG_USBD_EPA_CFG)
#define     rEPA_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPA_START_ADDR)
#define     rEPA_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPA_END_ADDR)
#define     rEPB_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPB_DATA_BUF)
#define     rEPB_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPB_IRQ_STAT)
#define     rEPB_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPB_IRQ_ENB)
#define     rEPB_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPB_DATA_CNT)
#define     rEPB_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPB_RSP_SC)
#define     rEPB_MPS		(*(unsigned int volatile *)REG_USBD_EPB_MPS)
#define     rEPB_TRF_CNT	(*(unsigned int volatile *)REG_USBD_EPB_TRF_CNT)
#define     rEPB_CFG		(*(unsigned int volatile *)REG_USBD_EPB_CFG)
#define     rEPB_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPB_START_ADDR)
#define     rEPB_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPB_END_ADDR)
#define     rEPC_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPC_DATA_BUF)
#define     rEPC_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPC_IRQ_STAT)
#define     rEPC_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPC_IRQ_ENB)
#define     rEPC_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPC_DATA_CNT)
#define     rEPC_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPC_RSP_SC)
#define     rEPC_MPS		(*(unsigned int volatile *)REG_USBD_EPC_MPS)
#define     rEPC_TRF_CNT	(*(unsigned int volatile *)REG_USBD_EPC_TRF_CNT)
#define     rEPC_CFG		(*(unsigned int volatile *)REG_USBD_EPC_CFG)
#define     rEPC_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPC_START_ADDR)
#define     rEPC_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPC_END_ADDR)
#define     rEPD_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPD_DATA_BUF)
#define     rEPD_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPD_IRQ_STAT)
#define     rEPD_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPD_IRQ_ENB)
#define     rEPD_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPD_DATA_CNT)
#define     rEPD_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPD_RSP_SC)
#define     rEPD_MPS		(*(unsigned int volatile *)REG_USBD_EPD_MPS)
#define     rEPD_TRF_CNT	(*(unsigned int volatile *)REG_USBD_EPD_TRF_CNT)
#define     rEPD_CFG		(*(unsigned int volatile *)REG_USBD_EPD_CFG)
#define     rEPD_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPD_START_ADDR)
#define     rEPD_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPD_END_ADDR)
#define     rEPE_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPE_DATA_BUF)
#define     rEPE_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPE_IRQ_STAT)
#define     rEPE_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPE_IRQ_ENB)
#define     rEPE_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPE_DATA_CNT)
#define     rEPE_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPE_RSP_SC)
#define     rEPE_MPS		(*(unsigned int volatile *)REG_USBD_EPE_MPS)
#define     rEPE_TRF_CNT	(*(unsigned int volatile *)REG_USBD_EPE_TRF_CNT)
#define     rEPE_CFG		(*(unsigned int volatile *)REG_USBD_EPE_CFG)
#define     rEPE_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPE_START_ADDR)
#define     rEPE_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPE_END_ADDR)
#define     rEPF_DATA_BUF	(*(unsigned int volatile *)REG_USBD_EPF_DATA_BUF)
#define     rEPF_IRQ_STAT	(*(unsigned int volatile *)REG_USBD_EPF_IRQ_STAT)
#define     rEPF_IRQ_ENB	(*(unsigned int volatile *)REG_USBD_EPF_IRQ_ENB)
#define     rEPF_DATA_CNT	(*(unsigned int volatile *)REG_USBD_EPF_DATA_CNT)
#define     rEPF_RSP_SC		(*(unsigned int volatile *)REG_USBD_EPF_RSP_SC)
#define     rEPF_MPS		(*(unsigned int volatile *)REG_USBD_EPF_MPS)
#define     rEPF_TRF_CNT	(*(unsigned int volatile *)REG_USBD_EPF_TRF_CNT)
#define     rEPF_CFG		(*(unsigned int volatile *)REG_USBD_EPF_CFG)
#define     rEPF_START_ADDR	(*(unsigned int volatile *)REG_USBD_EPF_START_ADDR)
#define     rEPF_END_ADDR	(*(unsigned int volatile *)REG_USBD_EPF_END_ADDR)
#define     rAHB_DMA_ADDR	(*(unsigned int volatile *)REG_USBD_AHB_DMA_ADDR)
#define     rUSB_PHY_CTL	(*(unsigned int volatile *)REG_USB_PHY_CTL)


