Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/*
  2-D Graphic Engine Control Registers  
*/
#define     REG_2D_GETG			(GE_BA+0x00)  /* Graphic Engine Trigger Control Register */
#define     REG_2D_GEXYSORG		(GE_BA+0x04)  /* Graphic Engine XY Mode Source Origin Starting Register */
#define     REG_2D_TileXY_VHSF	(GE_BA+0x08)  /* Graphic Engine Tile Width/Height or V/H Scale Factor N/M */
#define     REG_2D_GERRXY		(GE_BA+0x0C)  /* Graphic Engine Rotate Reference Point XY Address */
#define     REG_2D_GEINTS		(GE_BA+0x10)  /* Graphic Engine Interrupt Status Register */
#define     REG_2D_GEPLS		(GE_BA+0x14)  /* Graphic Engine Pattern Location Starting Address Register */
#define     REG_2D_GEBER		(GE_BA+0x18)  /* GE Bresenham Error Term Stepping Constant Register */
#define     REG_2D_GEBIR		(GE_BA+0x1C)  /* GE Bresenham Initial Error, Pixel Count Major M Register */
#define     REG_2D_GEC			(GE_BA+0x20)  /* Graphic Engine Control Register */
#define     REG_2D_GEBC			(GE_BA+0x24)  /* Graphic Engine Background Color Register */
#define     REG_2D_GEFC			(GE_BA+0x28)  /* Graphic Engine Foreground Color Register */
#define     REG_2D_GETC			(GE_BA+0x2C)  /* Graphic Engine Transparency Color Register */
#define     REG_2D_GETCM		(GE_BA+0x30)  /* Graphic Engine Transparency Color Mask Register */
#define     REG_2D_GEXYDORG		(GE_BA+0x34)  /* Graphic Engine XY Mode Display Origin Starting Register */
#define     REG_2D_GESDP		(GE_BA+0x38)  /* Graphic Engine Source/Destination Pitch Register */
#define     REG_2D_GESSXYL		(GE_BA+0x3C)  /* Graphic Engine Source Start XY/Linear Address Register */
#define     REG_2D_GEDSXYL		(GE_BA+0x40)  /* Graphic Engine Destination Start XY/Linear Register */
#define     REG_2D_GEDIXYL		(GE_BA+0x44)  /* Graphic Engine Dimension XY/Linear Register */
#define     REG_2D_GECBTL		(GE_BA+0x48)  /* Graphic Engine Clipping Boundary Top/Left Register */
#define     REG_2D_GECBBR		(GE_BA+0x4C)  /* Graphic Engine Clipping Boundary Bottom/Right Register */
#define     REG_2D_GEPTNA		(GE_BA+0x50)  /* Graphic Engine Pattern A Register */
#define     REG_2D_GEPTNB		(GE_BA+0x54)  /* Graphic Engine Pattern B Register */
#define     REG_2D_GEWPM		(GE_BA+0x58)  /* Graphic Engine Write Plane Mask Register */
#define     REG_2D_GEMC			(GE_BA+0x5C)  /* Graphic Engine Miscellaneous Control Register */

#define     rGETG			(*(unsigned int volatile *)REG_2D_GETG)
#define     rGEXYSORG		(*(unsigned int volatile *)REG_2D_GEXYSORG)
#define     rTileXY_VHSF	(*(unsigned int volatile *)REG_2D_TileXY_VHSF)
#define     rGERRXY			(*(unsigned int volatile *)REG_2D_GERRXY)
#define     rGEINTS			(*(unsigned int volatile *)REG_2D_GEINTS)
#define     rGEPLS			(*(unsigned int volatile *)REG_2D_GEPLS)
#define     rGEBER			(*(unsigned int volatile *)REG_2D_GEBER)
#define     rGEBIR			(*(unsigned int volatile *)REG_2D_GEBIR)
#define     rGEC			(*(unsigned int volatile *)REG_2D_GEC)
#define     rGEBC			(*(unsigned int volatile *)REG_2D_GEBC)
#define     rGEFC			(*(unsigned int volatile *)REG_2D_GEFC)
#define     rGETC			(*(unsigned int volatile *)REG_2D_GETC)
#define     rGETCM			(*(unsigned int volatile *)REG_2D_GETCM)
#define     rGEXYDORG		(*(unsigned int volatile *)REG_2D_GEXYDORG)
#define     rGESDP			(*(unsigned int volatile *)REG_2D_GESDP)
#define     rGESSXYL		(*(unsigned int volatile *)REG_2D_GESSXYL)
#define     rGEDSXYL		(*(unsigned int volatile *)REG_2D_GEDSXYL)
#define     rGEDIXYL		(*(unsigned int volatile *)REG_2D_GEDIXYL)
#define     rGECBTL			(*(unsigned int volatile *)REG_2D_GECBTL)
#define     rGECBBR			(*(unsigned int volatile *)REG_2D_GECBBR)
#define     rGEPTNA			(*(unsigned int volatile *)REG_2D_GEPTNA)
#define     rGEPTNB			(*(unsigned int volatile *)REG_2D_GEPTNB)
#define     rGEWPM			(*(unsigned int volatile *)REG_2D_GEWPM)
#define     rGEMC			(*(unsigned int volatile *)REG_2D_GEMC)


/*
  DMAC Control Registers
*/
#define     REG_FB0			(DMAC_BA+0x000)  /* DMAC Control and Status Register */
#define     REG_DMACCSR		(DMAC_BA+0x800)  /* DMAC Control and Status Register */
#define     REG_DMACSAR1	(DMAC_BA+0x804)  /* DMAC Transfer Starting Address Register 1 */
#define     REG_DMACSAR2	(DMAC_BA+0x808)  /* DMAC Transfer Starting Address Register 2 */
#define     REG_DMACBCR		(DMAC_BA+0x80C)  /* DMAC Transfer Byte Count Register */
#define     REG_DMACIER		(DMAC_BA+0x810)  /* DMAC Interrupt Enable Register */
#define     REG_DMACISR		(DMAC_BA+0x814)  /* DMAC Interrupt Status Register */

#define     rDMACCSR		(*(unsigned int volatile *)REG_DMACCSR)
#define     rDMACSAR1		(*(unsigned int volatile *)REG_DMACSAR1)
#define     rDMACSAR2		(*(unsigned int volatile *)REG_DMACSAR2)
#define     rDMACBCR		(*(unsigned int volatile *)REG_DMACBCR)
#define     rDMACIER		(*(unsigned int volatile *)REG_DMACIER)
#define     rDMACISR		(*(unsigned int volatile *)REG_DMACISR)


/*
  Flash Memory Interface Control Registers  
*/
#define     REG_FMICSR		(FMI_BA+0x000)   /* Global Control and Status Register */
#define     REG_FMIIER		(FMI_BA+0x004)   /* Global Interrupt Control Register */
#define     REG_FMIISR		(FMI_BA+0x008)   /* Global Interrupt Status Register */

/* Secure Digit Registers */
#define     REG_SDCSR		(FMI_BA+0x020)   /* SD control and status register */
#define     REG_SDARG		(FMI_BA+0x024)   /* SD command argument register */
#define     REG_SDIER		(FMI_BA+0x028)   /* SD interrupt enable register */
#define     REG_SDISR		(FMI_BA+0x02C)   /* SD interrupt status register */
#define     REG_SDRSP0		(FMI_BA+0x030)   /* SD receive response token register 0 */
#define     REG_SDRSP1		(FMI_BA+0x034)   /* SD receive response token register 1 */
#define     REG_SDBLEN		(FMI_BA+0x038)   /* SD block length register */
 
/* Memory Stick Registers */
#define     REG_MSCSR		(FMI_BA+0x060)   /* MS control and status register */
#define     REG_MSIER		(FMI_BA+0x064)   /* MS interrupt control register */
#define     REG_MSISR		(FMI_BA+0x068)   /* MS interrupt status register */
#define     REG_MSBUF1		(FMI_BA+0x06C)   /* Memory stick register buffer 1 */
#define     REG_MSBUF2		(FMI_BA+0x070)   /* Memory stick register buffer 2 */

/* NAND-type Flash Registers */
#define     REG_SMCSR		(FMI_BA+0x0A0)   /* NAND Flash Control and Status Register */
#define     REG_SMTCR		(FMI_BA+0x0A4)   /* NAND Flash Timing Control Register */
#define     REG_SMIER		(FMI_BA+0x0A8)   /* NAND Flash Interrupt Control Register */
#define     REG_SMISR		(FMI_BA+0x0AC)   /* NAND Flash Interrupt Status Register */
#define     REG_SMCMD		(FMI_BA+0x0B0)   /* NAND Flash Command Port Register */
#define     REG_SMADDR		(FMI_BA+0x0B4)   /* NAND Flash Address Port Register */
#define     REG_SMDATA		(FMI_BA+0x0B8)   /* NAND Flash Data Port Register */
#define     REG_SMECC0		(FMI_BA+0x0BC)   /* NAND Flash Error Correction Code 0 Register */
#define     REG_SMECC1		(FMI_BA+0x0C0)   /* NAND Flash Error Correction Code 1 Register */
#define     REG_SMECC2		(FMI_BA+0x0C4)   /* NAND Flash Error Correction Code 2 Register */
#define     REG_SMECC3		(FMI_BA+0x0C8)   /* NAND Flash a Error Correction Code 3 Register */
#define     REG_SMRA_0		(FMI_BA+0x0CC)   /* NAND Flash Redundant Area Register */
#define     REG_SMRA_1		(FMI_BA+0x0D0)
#define     REG_SMRA_2		(FMI_BA+0x0D4)
#define     REG_SMRA_3		(FMI_BA+0x0D8)
#define     REG_SMRA_4		(FMI_BA+0x0DC)
#define     REG_SMRA_5		(FMI_BA+0x0E0)
#define     REG_SMRA_6		(FMI_BA+0x0E4)
#define     REG_SMRA_7		(FMI_BA+0x0E8)
#define     REG_SMRA_8		(FMI_BA+0x0EC)
#define     REG_SMRA_9		(FMI_BA+0x0F0)
#define     REG_SMRA_10		(FMI_BA+0x0F4)
#define     REG_SMRA_11		(FMI_BA+0x0F8)
#define     REG_SMRA_12		(FMI_BA+0x0FC)
#define     REG_SMRA_13		(FMI_BA+0x100)
#define     REG_SMRA_14		(FMI_BA+0x104)
#define     REG_SMRA_15		(FMI_BA+0x108)   /* NAND Flash Redundant Area Register */
#define     REG_SMECCAD0	(FMI_BA+0x10C)   /* NAND Flash ECC Correction Address 0 */
#define     REG_SMECCAD1	(FMI_BA+0x110)   /* NAND Flash ECC Correction Address 1 */
#define     REG_ECC4ST		(FMI_BA+0x114)   /* ECC4 Correction Status */
#define     REG_ECC4F1A1	(FMI_BA+0x118)   /* ECC4 Field 1 Error Address 1 */
#define     REG_ECC4F1A2	(FMI_BA+0x11C)   /* ECC4 Field 1 Error Address 2 */
#define     REG_ECC4F1D		(FMI_BA+0x120)   /* ECC4 Field 1 Error Data */
#define     REG_ECC4F2A1	(FMI_BA+0x124)   /* ECC4 Field 2 Error Address 1 */
#define     REG_ECC4F2A2	(FMI_BA+0x128)   /* ECC4 Field 2 Error Address 2 */
#define     REG_ECC4F2D		(FMI_BA+0x12C)   /* ECC4 Field 2 Error Data */
#define     REG_ECC4F3A1	(FMI_BA+0x130)   /* ECC4 Field 3 Error Address 1 */
#define     REG_ECC4F3A2	(FMI_BA+0x134)   /* ECC4 Field 3 Error Address 2 */
#define     REG_ECC4F3D		(FMI_BA+0x138)   /* ECC4 Field 3 Error Data */
#define     REG_ECC4F4A1	(FMI_BA+0x13C)   /* ECC4 Field 4 Error Address 1 */
#define     REG_ECC4F4A2	(FMI_BA+0x140)   /* ECC4 Field 4 Error Address 2 */
#define     REG_ECC4F4D		(FMI_BA+0x144)   /* ECC4 Field 4 Error Data */




#define     rFMICSR			(*(unsigned int volatile *)REG_FMICSR)
#define     rFMIIER			(*(unsigned int volatile *)REG_FMIIER)
#define     rFMIISR			(*(unsigned int volatile *)REG_FMIISR)
/* Secure Digit Registers */
#define     rSDCSR			(*(unsigned int volatile *)REG_SDCSR)
#define     rSDARG			(*(unsigned int volatile *)REG_SDARG)
#define     rSDIER			(*(unsigned int volatile *)REG_SDIER)
#define     rSDISR			(*(unsigned int volatile *)REG_SDISR)
#define     rSDRSP0			(*(unsigned int volatile *)REG_SDRSP0)
#define     rSDRSP1			(*(unsigned int volatile *)REG_SDRSP1)
#define     rSDBLEN			(*(unsigned int volatile *)REG_SDBLEN)
/* Memory Stick Registers */
#define     rMSCSR			(*(unsigned int volatile *)REG_MSCSR)
#define     rMSIER			(*(unsigned int volatile *)REG_MSIER)
#define     rMSISR			(*(unsigned int volatile *)REG_MSISR)
#define     rMSBUF1			(*(unsigned int volatile *)REG_MSBUF1)
#define     rMSBUF2			(*(unsigned int volatile *)REG_MSBUF2)
/* NAND-type Flash Registers */
#define     rSMCSR			(*(unsigned int volatile *)REG_SMCSR)
#define     rSMTCR			(*(unsigned int volatile *)REG_SMTCR)
#define     rSMIER			(*(unsigned int volatile *)REG_SMIER)
#define     rSMISR			(*(unsigned int volatile *)REG_SMISR)
#define     rSMCMD			(*(unsigned int volatile *)REG_SMCMD)
#define     rSMADDR			(*(unsigned int volatile *)REG_SMADDR)
#define     rSMDATA			(*(unsigned int volatile *)REG_SMDATA)
#define     rSMECC0			(*(unsigned int volatile *)REG_SMECC0)
#define     rSMECC1			(*(unsigned int volatile *)REG_SMECC1)
#define     rSMECC2			(*(unsigned int volatile *)REG_SMECC2)
#define     rSMECC3			(*(unsigned int volatile *)REG_SMECC3)
#define     rSMRA_0			(*(unsigned int volatile *)REG_SMRA_0)
#define     rSMRA_1			(*(unsigned int volatile *)REG_SMRA_1)
#define     rSMRA_2			(*(unsigned int volatile *)REG_SMRA_2)
#define     rSMRA_3			(*(unsigned int volatile *)REG_SMRA_3)
#define     rSMRA_4			(*(unsigned int volatile *)REG_SMRA_4)
#define     rSMRA_5			(*(unsigned int volatile *)REG_SMRA_5)
#define     rSMRA_6			(*(unsigned int volatile *)REG_SMRA_6)
#define     rSMRA_7			(*(unsigned int volatile *)REG_SMRA_7)
#define     rSMRA_8			(*(unsigned int volatile *)REG_SMRA_8)
#define     rSMRA_9			(*(unsigned int volatile *)REG_SMRA_9)
#define     rSMRA_10		(*(unsigned int volatile *)REG_SMRA_10)
#define     rSMRA_11		(*(unsigned int volatile *)REG_SMRA_11)
#define     rSMRA_12		(*(unsigned int volatile *)REG_SMRA_12)
#define     rSMRA_13		(*(unsigned int volatile *)REG_SMRA_13)
#define     rSMRA_14		(*(unsigned int volatile *)REG_SMRA_14)
#define     rSMRA_15		(*(unsigned int volatile *)REG_SMRA_15)
#define     rSMECCAD0		(*(unsigned int volatile *)REG_SMECCAD0)
#define     rSMECCAD1		(*(unsigned int volatile *)REG_SMECCAD1)
#define     rECC4ST			(*(unsigned int volatile *)REG_ECC4ST)
#define     rECC4F1A1		(*(unsigned int volatile *)REG_ECC4F1A1)
#define     rECC4F1A2		(*(unsigned int volatile *)REG_ECC4F1A2)
#define     rECC4F1D		(*(unsigned int volatile *)REG_ECC4F1D)
#define     rECC4F2A1		(*(unsigned int volatile *)REG_ECC4F2A1)
#define     rECC4F2A2		(*(unsigned int volatile *)REG_ECC4F2A2)
#define     rECC4F2D		(*(unsigned int volatile *)REG_ECC4F2D)
#define     rECC4F3A1		(*(unsigned int volatile *)REG_ECC4F3A1)
#define     rECC4F3A2		(*(unsigned int volatile *)REG_ECC4F3A2)
#define     rECC4F3D		(*(unsigned int volatile *)REG_ECC4F3D)
#define     rECC4F4A1		(*(unsigned int volatile *)REG_ECC4F4A1)
#define     rECC4F4A2		(*(unsigned int volatile *)REG_ECC4F4A2)
#define     rECC4F4D		(*(unsigned int volatile *)REG_ECC4F4D)


