Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/*
  UART0 Control Registers
*/
#define     REG_UART0_RBR	(UART0_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART0_THR	(UART0_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART0_IER	(UART0_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART0_DLL	(UART0_BA+0x00)  /* Divisor Latch Register (LS) */
#define     REG_UART0_DLM	(UART0_BA+0x04)  /* Divisor Latch Register (MS) */
#define     REG_UART0_IIR	(UART0_BA+0x08)  /* Interrupt Identification Register */
#define     REG_UART0_FCR	(UART0_BA+0x08)  /* FIFO Control Register */
#define     REG_UART0_LCR	(UART0_BA+0x0C)  /* Line Control Register */
#define     REG_UART0_MCR	(UART0_BA+0x10)  /* Modem Control Register */
#define     REG_UART0_LSR	(UART0_BA+0x14)  /* Line Status Register */
#define     REG_UART0_MSR	(UART0_BA+0x18)  /* MODEM Status Register */
#define     REG_UART0_TOR	(UART0_BA+0x1C)  /* Time Out Register */

#define     rUART0_RBR		(*(unsigned int volatile *)REG_UART0_RBR)
#define     rUART0_THR		(*(unsigned int volatile *)REG_UART0_THR)
#define     rUART0_IER		(*(unsigned int volatile *)REG_UART0_IER)
#define     rUART0_DLL		(*(unsigned int volatile *)REG_UART0_DLL)
#define     rUART0_DLM		(*(unsigned int volatile *)REG_UART0_DLM)
#define     rUART0_IIR		(*(unsigned int volatile *)REG_UART0_IIR)
#define     rUART0_FCR		(*(unsigned int volatile *)REG_UART0_FCR)
#define     rUART0_LCR		(*(unsigned int volatile *)REG_UART0_LCR)
#define     rUART0_MCR		(*(unsigned int volatile *)REG_UART0_MCR)
#define     rUART0_LSR		(*(unsigned int volatile *)REG_UART0_LSR)
#define     rUART0_MSR		(*(unsigned int volatile *)REG_UART0_MSR)
#define     rUART0_TOR		(*(unsigned int volatile *)REG_UART0_TOR)

/*
  UART1 Control Registers
*/
#define     REG_UART1_RBR	(UART1_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART1_THR	(UART1_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART1_IER	(UART1_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART1_DLL	(UART1_BA+0x00)  /* Divisor Latch Register (LS) */
#define     REG_UART1_DLM	(UART1_BA+0x04)  /* Divisor Latch Register (MS) */
#define     REG_UART1_IIR	(UART1_BA+0x08)  /* Interrupt Identification Register */
#define     REG_UART1_FCR	(UART1_BA+0x08)  /* FIFO Control Register */
#define     REG_UART1_LCR	(UART1_BA+0x0C)  /* Line Control Register */
#define     REG_UART1_MCR	(UART1_BA+0x10)  /* Modem Control Register */
#define     REG_UART1_LSR	(UART1_BA+0x14)  /* Line Status Register */
#define     REG_UART1_MSR	(UART1_BA+0x18)  /* MODEM Status Register */
#define     REG_UART1_TOR	(UART1_BA+0x1C)  /* Time Out Register */

#define     rUART1_RBR		(*(unsigned int volatile *)REG_UART1_RBR)
#define     rUART1_THR		(*(unsigned int volatile *)REG_UART1_THR)
#define     rUART1_IER		(*(unsigned int volatile *)REG_UART1_IER)
#define     rUART1_DLL		(*(unsigned int volatile *)REG_UART1_DLL)
#define     rUART1_DLM		(*(unsigned int volatile *)REG_UART1_DLM)
#define     rUART1_IIR		(*(unsigned int volatile *)REG_UART1_IIR)
#define     rUART1_FCR		(*(unsigned int volatile *)REG_UART1_FCR)
#define     rUART1_LCR		(*(unsigned int volatile *)REG_UART1_LCR)
#define     rUART1_MCR		(*(unsigned int volatile *)REG_UART1_MCR)
#define     rUART1_LSR		(*(unsigned int volatile *)REG_UART1_LSR)
#define     rUART1_MSR		(*(unsigned int volatile *)REG_UART1_MSR)
#define     rUART1_TOR		(*(unsigned int volatile *)REG_UART1_TOR)


/*
  UART2 Control Registers
*/
#define     REG_UART2_RBR	(UART2_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART2_THR	(UART2_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART2_IER	(UART2_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART2_DLL	(UART2_BA+0x00)  /* Divisor Latch Register (LS) */
#define     REG_UART2_DLM	(UART2_BA+0x04)  /* Divisor Latch Register (MS) */
#define     REG_UART2_IIR	(UART2_BA+0x08)  /* Interrupt Identification Register */
#define     REG_UART2_FCR	(UART2_BA+0x08)  /* FIFO Control Register */
#define     REG_UART2_LCR	(UART2_BA+0x0C)  /* Line Control Register */
#define     REG_UART2_MCR	(UART2_BA+0x10)  /* Modem Control Register */
#define     REG_UART2_LSR	(UART2_BA+0x14)  /* Line Status Register */
#define     REG_UART2_MSR	(UART2_BA+0x18)  /* MODEM Status Register */
#define     REG_UART2_TOR	(UART2_BA+0x1C)  /* Time Out Register */
#define     REG_UART2_IRCR	(UART2_BA+0x20)  /* IrDA Control Register */

#define     rUART2_RBR		(*(unsigned int volatile *)REG_UART2_RBR)
#define     rUART2_THR		(*(unsigned int volatile *)REG_UART2_THR)
#define     rUART2_IER		(*(unsigned int volatile *)REG_UART2_IER)
#define     rUART2_DLL		(*(unsigned int volatile *)REG_UART2_DLL)
#define     rUART2_DLM		(*(unsigned int volatile *)REG_UART2_DLM)
#define     rUART2_IIR		(*(unsigned int volatile *)REG_UART2_IIR)
#define     rUART2_FCR		(*(unsigned int volatile *)REG_UART2_FCR)
#define     rUART2_LCR		(*(unsigned int volatile *)REG_UART2_LCR)
#define     rUART2_MCR		(*(unsigned int volatile *)REG_UART2_MCR)
#define     rUART2_LSR		(*(unsigned int volatile *)REG_UART2_LSR)
#define     rUART2_MSR		(*(unsigned int volatile *)REG_UART2_MSR)
#define     rUART2_TOR		(*(unsigned int volatile *)REG_UART2_TOR)
#define     rUART2_IRCR		(*(unsigned int volatile *)REG_UART2_IRCR)

/*
  UART3 Control Registers
*/
#define     REG_UART3_RBR	(UART3_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART3_THR	(UART3_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART3_IER	(UART3_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART3_DLL	(UART3_BA+0x00)  /* Divisor Latch Register (LS) */
#define     REG_UART3_DLM	(UART3_BA+0x04)  /* Divisor Latch Register (MS) */
#define     REG_UART3_IIR	(UART3_BA+0x08)  /* Interrupt Identification Register */
#define     REG_UART3_FCR	(UART3_BA+0x08)  /* FIFO Control Register */
#define     REG_UART3_LCR	(UART3_BA+0x0C)  /* Line Control Register */
#define     REG_UART3_MCR	(UART3_BA+0x10)  /* Modem Control Register */
#define     REG_UART3_LSR	(UART3_BA+0x14)  /* Line Status Register */
#define     REG_UART3_MSR	(UART3_BA+0x18)  /* MODEM Status Register */
#define     REG_UART3_TOR	(UART3_BA+0x1C)  /* Time Out Register */

#define     rUART3_RBR		(*(unsigned int volatile *)REG_UART3_RBR)
#define     rUART3_THR		(*(unsigned int volatile *)REG_UART3_THR)
#define     rUART3_IER		(*(unsigned int volatile *)REG_UART3_IER)
#define     rUART3_DLL		(*(unsigned int volatile *)REG_UART3_DLL)
#define     rUART3_DLM		(*(unsigned int volatile *)REG_UART3_DLM)
#define     rUART3_IIR		(*(unsigned int volatile *)REG_UART3_IIR)
#define     rUART3_FCR		(*(unsigned int volatile *)REG_UART3_FCR)
#define     rUART3_LCR		(*(unsigned int volatile *)REG_UART3_LCR)
#define     rUART3_MCR		(*(unsigned int volatile *)REG_UART3_MCR)
#define     rUART3_LSR		(*(unsigned int volatile *)REG_UART3_LSR)
#define     rUART3_MSR		(*(unsigned int volatile *)REG_UART3_MSR)
#define     rUART3_TOR		(*(unsigned int volatile *)REG_UART3_TOR)


