Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/*
  UART4 Control Registers
*/
#define     REG_UART4_RBR	(UART4_BA+0x00)  /* Receive Buffer Register */
#define     REG_UART4_THR	(UART4_BA+0x00)  /* Transmit Holding Register */
#define     REG_UART4_IER	(UART4_BA+0x04)  /* Interrupt Enable Register */
#define     REG_UART4_DLL	(UART4_BA+0x00)  /* Divisor Latch Register (LS) */
#define     REG_UART4_DLM	(UART4_BA+0x04)  /* Divisor Latch Register (MS) */
#define     REG_UART4_IIR	(UART4_BA+0x08)  /* Interrupt Identification Register */
#define     REG_UART4_FCR	(UART4_BA+0x08)  /* FIFO Control Register */
#define     REG_UART4_LCR	(UART4_BA+0x0C)  /* Line Control Register */
#define     REG_UART4_MCR	(UART4_BA+0x10)  /* Modem Control Register */
#define     REG_UART4_LSR	(UART4_BA+0x14)  /* Line Status Register */
#define     REG_UART4_MSR	(UART4_BA+0x18)  /* MODEM Status Register */
#define     REG_UART4_TOR	(UART4_BA+0x1C)  /* Time Out Register */

#define     rUART4_RBR		(*(unsigned int volatile *)REG_UART4_RBR)
#define     rUART4_THR		(*(unsigned int volatile *)REG_UART4_THR)
#define     rUART4_IER		(*(unsigned int volatile *)REG_UART4_IER)
#define     rUART4_DLL		(*(unsigned int volatile *)REG_UART4_DLL)
#define     rUART4_DLM		(*(unsigned int volatile *)REG_UART4_DLM)
#define     rUART4_IIR		(*(unsigned int volatile *)REG_UART4_IIR)
#define     rUART4_FCR		(*(unsigned int volatile *)REG_UART4_FCR)
#define     rUART4_LCR		(*(unsigned int volatile *)REG_UART4_LCR)
#define     rUART4_MCR		(*(unsigned int volatile *)REG_UART4_MCR)
#define     rUART4_LSR		(*(unsigned int volatile *)REG_UART4_LSR)
#define     rUART4_MSR		(*(unsigned int volatile *)REG_UART4_MSR)
#define     rUART4_TOR		(*(unsigned int volatile *)REG_UART4_TOR)


/* 
  Timer Control Registers 
*/
#define     REG_TCSR0		(TMR_BA+0x00)  /* Timer Control and Status Register 0 */
#define     REG_TCSR1		(TMR_BA+0x04)  /* Timer Control and Status Register 1 */
#define     REG_TICR0		(TMR_BA+0x08)  /* Timer Initial Control Register 0 */
#define     REG_TICR1		(TMR_BA+0x0C)  /* Timer Initial Control Register 1 */
#define     REG_TDR0		(TMR_BA+0x10)  /* Timer Data Register 0 */
#define     REG_TDR1		(TMR_BA+0x14)  /* Timer Data Register 1 */
#define     REG_TISR		(TMR_BA+0x18)  /* Timer Interrupt Status Register */
#define     REG_WTCR		(TMR_BA+0x1C)  /* Watchdog Timer Control Register */
#define     REG_TCSR2		(TMR_BA+0x20)  /* Timer Control and Status Register 2 */
#define     REG_TCSR3		(TMR_BA+0x24)  /* Timer Control and Status Register 3 */
#define     REG_TICR2		(TMR_BA+0x28)  /* Timer Initial Control Register 2 */
#define     REG_TICR3		(TMR_BA+0x2C)  /* Timer Initial Control Register 3 */
#define     REG_TDR2		(TMR_BA+0x30)  /* Timer Data Register 2 */
#define     REG_TDR3		(TMR_BA+0x34)  /* Timer Data Register 3 */
#define     REG_TCSR4		(TMR_BA+0x40)  /* Timer Control and Status Register 4 */
#define     REG_TICR4		(TMR_BA+0x48)  /* Timer Initial Control Register 4 */
#define     REG_TDR4		(TMR_BA+0x50)  /* Timer Data Register 4 */

#define     rTCSR0			(*(unsigned int volatile *)REG_TCSR0)
#define     rTCSR1			(*(unsigned int volatile *)REG_TCSR1)
#define     rTICR0			(*(unsigned int volatile *)REG_TICR0)
#define     rTICR1			(*(unsigned int volatile *)REG_TICR1)
#define     rTDR0			(*(unsigned int volatile *)REG_TDR0)
#define     rTDR1			(*(unsigned int volatile *)REG_TDR1)
#define     rTISR			(*(unsigned int volatile *)REG_TISR)
#define     rWTCR			(*(unsigned int volatile *)REG_WTCR)
#define     rTCSR2			(*(unsigned int volatile *)REG_TCSR2)
#define     rTCSR3			(*(unsigned int volatile *)REG_TCSR3)
#define     rTICR2			(*(unsigned int volatile *)REG_TICR2)
#define     rTICR3			(*(unsigned int volatile *)REG_TICR3)
#define     rTDR2			(*(unsigned int volatile *)REG_TDR2)
#define     rTDR3			(*(unsigned int volatile *)REG_TDR3)
#define     rTCSR4			(*(unsigned int volatile *)REG_TCSR4)
#define     rTICR4			(*(unsigned int volatile *)REG_TICR4)
#define     rTDR4			(*(unsigned int volatile *)REG_TDR4)


/*
  Advance Interrupt Controller (AIC) Registers
*/
#define     REG_AIC_SCR1    (AIC_BA+0x04)    /* Source control register 1 */
#define     REG_AIC_SCR2    (AIC_BA+0x08)    /* Source control register 2 */
#define     REG_AIC_SCR3    (AIC_BA+0x0C)    /* Source control register 3 */
#define     REG_AIC_SCR4    (AIC_BA+0x10)    /* Source control register 4 */
#define     REG_AIC_SCR5    (AIC_BA+0x14)    /* Source control register 5 */
#define     REG_AIC_SCR6    (AIC_BA+0x18)    /* Source control register 6 */
#define     REG_AIC_SCR7    (AIC_BA+0x1C)    /* Source control register 7 */
#define     REG_AIC_SCR8    (AIC_BA+0x20)    /* Source control register 8 */
#define     REG_AIC_SCR9    (AIC_BA+0x24)    /* Source control register 9 */
#define     REG_AIC_SCR10   (AIC_BA+0x28)    /* Source control register 10 */
#define     REG_AIC_SCR11   (AIC_BA+0x2C)    /* Source control register 11 */
#define     REG_AIC_SCR12   (AIC_BA+0x30)    /* Source control register 12 */
#define     REG_AIC_SCR13   (AIC_BA+0x34)    /* Source control register 13 */
#define     REG_AIC_SCR14   (AIC_BA+0x38)    /* Source control register 14 */
#define     REG_AIC_SCR15   (AIC_BA+0x3C)    /* Source control register 15 */
#define     REG_AIC_SCR16   (AIC_BA+0x40)    /* Source control register 16 */
#define     REG_AIC_SCR17   (AIC_BA+0x44)    /* Source control register 17 */
#define     REG_AIC_SCR18   (AIC_BA+0x48)    /* Source control register 18 */
#define     REG_AIC_SCR19   (AIC_BA+0x4C)    /* Source control register 19 */
#define     REG_AIC_SCR20   (AIC_BA+0x50)    /* Source control register 20 */
#define     REG_AIC_SCR21   (AIC_BA+0x54)    /* Source control register 21 */
#define     REG_AIC_SCR22   (AIC_BA+0x58)    /* Source control register 22 */
#define     REG_AIC_SCR23   (AIC_BA+0x5C)    /* Source control register 23 */
#define     REG_AIC_SCR24   (AIC_BA+0x60)    /* Source control register 24 */
#define     REG_AIC_SCR25   (AIC_BA+0x64)    /* Source control register 25 */
#define     REG_AIC_SCR26   (AIC_BA+0x68)    /* Source control register 26 */
#define     REG_AIC_SCR27   (AIC_BA+0x6C)    /* Source control register 27 */
#define     REG_AIC_SCR28   (AIC_BA+0x70)    /* Source control register 28 */
#define     REG_AIC_SCR29   (AIC_BA+0x74)    /* Source control register 29 */
#define     REG_AIC_SCR30   (AIC_BA+0x78)    /* Source control register 30 */
#define     REG_AIC_SCR31   (AIC_BA+0x7C)    /* Source control register 31 */
#define     REG_AIC_IRQSC   (AIC_BA+0x80)    /* External Interrupt Control Register */
#define     REG_AIC_GEN     (AIC_BA+0x84)    /* Interrupt Group Enable Control Register */
#define     REG_AIC_GASR    (AIC_BA+0x88)    /* Interrupt Group Active Status Register */
#define     REG_AIC_GSCR    (AIC_BA+0x8C)    /* Interrupt Group Status Clear Register */
#define     REG_AIC_IRSR    (AIC_BA+0x100)   /* Interrupt raw status register */
#define     REG_AIC_IASR    (AIC_BA+0x104)   /* Interrupt active status register */
#define     REG_AIC_ISR     (AIC_BA+0x108)   /* Interrupt status register */
#define     REG_AIC_IPER    (AIC_BA+0x10C)   /* Interrupt priority encoding register */
#define     REG_AIC_ISNR    (AIC_BA+0x110)   /* Interrupt source number register */
#define     REG_AIC_IMR     (AIC_BA+0x114)   /* Interrupt mask register */
#define     REG_AIC_OISR    (AIC_BA+0x118)   /* Output interrupt status register */
#define     REG_AIC_MECR    (AIC_BA+0x120)   /* Mask enable command register */
#define     REG_AIC_MDCR    (AIC_BA+0x124)   /* Mask disable command register */
#define     REG_AIC_EOSCR   (AIC_BA+0x130)   /* End of service command register */

