Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
#define     rAIC_SCR1    (*(unsigned int volatile *)REG_AIC_SCR1)
#define     rAIC_SCR2    (*(unsigned int volatile *)REG_AIC_SCR2)
#define     rAIC_SCR3    (*(unsigned int volatile *)REG_AIC_SCR3)
#define     rAIC_SCR4    (*(unsigned int volatile *)REG_AIC_SCR4)
#define     rAIC_SCR5    (*(unsigned int volatile *)REG_AIC_SCR5)
#define     rAIC_SCR6    (*(unsigned int volatile *)REG_AIC_SCR6)
#define     rAIC_SCR7    (*(unsigned int volatile *)REG_AIC_SCR7)
#define     rAIC_SCR8    (*(unsigned int volatile *)REG_AIC_SCR8)
#define     rAIC_SCR9    (*(unsigned int volatile *)REG_AIC_SCR9)
#define     rAIC_SCR10   (*(unsigned int volatile *)REG_AIC_SCR10)
#define     rAIC_SCR11   (*(unsigned int volatile *)REG_AIC_SCR11)
#define     rAIC_SCR12   (*(unsigned int volatile *)REG_AIC_SCR12)
#define     rAIC_SCR13   (*(unsigned int volatile *)REG_AIC_SCR13)
#define     rAIC_SCR14   (*(unsigned int volatile *)REG_AIC_SCR14)
#define     rAIC_SCR15   (*(unsigned int volatile *)REG_AIC_SCR15)
#define     rAIC_SCR16   (*(unsigned int volatile *)REG_AIC_SCR16)
#define     rAIC_SCR17   (*(unsigned int volatile *)REG_AIC_SCR17)
#define     rAIC_SCR18   (*(unsigned int volatile *)REG_AIC_SCR18)
#define     rAIC_SCR19   (*(unsigned int volatile *)REG_AIC_SCR19)
#define     rAIC_SCR20   (*(unsigned int volatile *)REG_AIC_SCR20)
#define     rAIC_SCR21   (*(unsigned int volatile *)REG_AIC_SCR21)
#define     rAIC_SCR22   (*(unsigned int volatile *)REG_AIC_SCR22)
#define     rAIC_SCR23   (*(unsigned int volatile *)REG_AIC_SCR23)
#define     rAIC_SCR24   (*(unsigned int volatile *)REG_AIC_SCR24)
#define     rAIC_SCR25   (*(unsigned int volatile *)REG_AIC_SCR25)
#define     rAIC_SCR26   (*(unsigned int volatile *)REG_AIC_SCR26)
#define     rAIC_SCR27   (*(unsigned int volatile *)REG_AIC_SCR27)
#define     rAIC_SCR28   (*(unsigned int volatile *)REG_AIC_SCR28)
#define     rAIC_SCR29   (*(unsigned int volatile *)REG_AIC_SCR29)
#define     rAIC_SCR30   (*(unsigned int volatile *)REG_AIC_SCR30)
#define     rAIC_SCR31   (*(unsigned int volatile *)REG_AIC_SCR31)
#define     rAIC_IRQSC   (*(unsigned int volatile *)REG_AIC_IRQSC)
#define     rAIC_GEN     (*(unsigned int volatile *)REG_AIC_GEN)
#define     rAIC_GASR    (*(unsigned int volatile *)REG_AIC_GASR)
#define     rAIC_GSCR    (*(unsigned int volatile *)REG_AIC_GSCR)
#define     rAIC_IRSR    (*(unsigned int volatile *)REG_AIC_IRSR)
#define     rAIC_IASR    (*(unsigned int volatile *)REG_AIC_IASR)
#define     rAIC_ISR     (*(unsigned int volatile *)REG_AIC_ISR)
#define     rAIC_IPER    (*(unsigned int volatile *)REG_AIC_IPER)
#define     rAIC_ISNR    (*(unsigned int volatile *)REG_AIC_ISNR)
#define     rAIC_IMR     (*(unsigned int volatile *)REG_AIC_IMR)
#define     rAIC_OISR    (*(unsigned int volatile *)REG_AIC_OISR)
#define     rAIC_MECR    (*(unsigned int volatile *)REG_AIC_MECR)
#define     rAIC_MDCR    (*(unsigned int volatile *)REG_AIC_MDCR)
#define     rAIC_EOSCR   (*(unsigned int volatile *)REG_AIC_EOSCR)


/*
  GPIO Control Registers  
*/
#define     REG_GPIOC_DIR		(GPIO_BA+0x04)  /* GPIO portC direction control register */
#define     REG_GPIOC_DATAOUT	(GPIO_BA+0x08)  /* GPIO portC data output register */
#define     REG_GPIOC_DATAIN	(GPIO_BA+0x0C)  /* GPIO portC data input register */
#define     REG_GPIOD_DIR		(GPIO_BA+0x14)  /* GPIO portD direction control register */
#define     REG_GPIOD_DATAOUT	(GPIO_BA+0x18)  /* GPIO portD data output register */
#define     REG_GPIOD_DATAIN	(GPIO_BA+0x1C)  /* GPIO portD data input register */
#define     REG_GPIOE_DIR		(GPIO_BA+0x24)  /* GPIO portE direction control register */
#define     REG_GPIOE_DATAOUT	(GPIO_BA+0x28)  /* GPIO portE data output register */
#define     REG_GPIOE_DATAIN	(GPIO_BA+0x2C)  /* GPIO portE data input register */
#define     REG_GPIOF_DIR		(GPIO_BA+0x34)  /* GPIO portF direction control register */
#define     REG_GPIOF_DATAOUT	(GPIO_BA+0x38)  /* GPIO portF data output register */
#define     REG_GPIOF_DATAIN	(GPIO_BA+0x3C)  /* GPIO portF data input register */
#define     REG_GPIOG_DIR		(GPIO_BA+0x44)  /* GPIO portG direction control register */
#define     REG_GPIOG_DATAOUT	(GPIO_BA+0x48)  /* GPIO portG data output register */
#define     REG_GPIOG_DATAIN	(GPIO_BA+0x4C)  /* GPIO portG data input register */
#define     REG_GPIOH_DBNCE		(GPIO_BA+0x50)  /* GPIO portH input debounce control reg. */
#define     REG_GPIOH_DIR		(GPIO_BA+0x54)  /* GPIO portH direction control register */
#define     REG_GPIOH_DATAOUT	(GPIO_BA+0x58)  /* GPIO portH data output register */
#define     REG_GPIOH_DATAIN	(GPIO_BA+0x5C)  /* GPIO portH data input register */
#define     REG_GPIOI_DIR		(GPIO_BA+0x64)  /* GPIO portI direction control register */
#define     REG_GPIOI_DATAOU	(GPIO_BA+0x68)  /* GPIO portI data output register */
#define     REG_GPIOI_DATAIN	(GPIO_BA+0x6C)  /* GPIO portI data input register */

#define     rGPIOC_DIR			(*(unsigned int volatile *)REG_GPIOC_DIR)
#define     rGPIOC_DATAOUT		(*(unsigned int volatile *)REG_GPIOC_DATAOUT)
#define     rGPIOC_DATAIN		(*(unsigned int volatile *)REG_GPIOC_DATAIN)
#define     rGPIOD_DIR			(*(unsigned int volatile *)REG_GPIOD_DIR)
#define     rGPIOD_DATAOUT		(*(unsigned int volatile *)REG_GPIOD_DATAOUT)
#define     rGPIOD_DATAIN		(*(unsigned int volatile *)REG_GPIOD_DATAIN)
#define     rGPIOE_DIR			(*(unsigned int volatile *)REG_GPIOE_DIR)
#define     rGPIOE_DATAOUT		(*(unsigned int volatile *)REG_GPIOE_DATAOUT)
#define     rGPIOE_DATAIN		(*(unsigned int volatile *)REG_GPIOE_DATAIN)
#define     rGPIOF_DIR			(*(unsigned int volatile *)REG_GPIOF_DIR)
#define     rGPIOF_DATAOUT		(*(unsigned int volatile *)REG_GPIOF_DATAOUT)
#define     rGPIOF_DATAIN		(*(unsigned int volatile *)REG_GPIOF_DATAIN)
#define     rGPIOG_DIR			(*(unsigned int volatile *)REG_GPIOG_DIR)
#define     rGPIOG_DATAOUT		(*(unsigned int volatile *)REG_GPIOG_DATAOUT)
#define     rGPIOG_DATAIN		(*(unsigned int volatile *)REG_GPIOG_DATAIN)
#define     rGPIOH_DBNCE		(*(unsigned int volatile *)REG_GPIOH_DBNCE)
#define     rGPIOH_DIR			(*(unsigned int volatile *)REG_GPIOH_DIR)
#define     rGPIOH_DATAOUT		(*(unsigned int volatile *)REG_GPIOH_DATAOUT)
#define     rGPIOH_DATAIN		(*(unsigned int volatile *)REG_GPIOH_DATAIN)
#define     rGPIOI_DIR			(*(unsigned int volatile *)REG_GPIOI_DIR)
#define     rGPIOI_DATAOU		(*(unsigned int volatile *)REG_GPIOI_DATAOU)
#define     rGPIOI_DATAIN		(*(unsigned int volatile *)REG_GPIOI_DATAIN)


