Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/* 
  RTC Control Registers
*/
#define     REG_RTC_INIR	(RTC_BA+0x00)   /* RTC Initiation Register */
#define     REG_RTC_AER		(RTC_BA+0x04)   /* RTC Access Enable Register */
#define     REG_RTC_FCR		(RTC_BA+0x08)   /* RTC Frequency Compensation Register */
#define     REG_RTC_TLR		(RTC_BA+0x0C)   /* Time Loading Register */
#define     REG_RTC_CLR		(RTC_BA+0x10)   /* Calendar Loading Register */
#define     REG_RTC_TSSR	(RTC_BA+0x14)   /* Time Scale Selection Register */
#define     REG_RTC_DWR		(RTC_BA+0x18)   /* Day of the Week Register */
#define     REG_RTC_TAR		(RTC_BA+0x1C)   /* Time Alarm Register */
#define     REG_RTC_CAR		(RTC_BA+0x20)   /* Calendar Alarm Register */
#define     REG_RTC_LIR		(RTC_BA+0x24)   /* Leap year Indicator Register */
#define     REG_RTC_RIER	(RTC_BA+0x28)   /* RTC Interrupt Enable Register */
#define     REG_RTC_RIIR	(RTC_BA+0x2C)   /* RTC Interrupt Indicator Register */
#define     REG_RTC_TTR		(RTC_BA+0x30)   /* RTC Time Tick Register */

#define     rRTC_INIR		(*(unsigned int volatile *)REG_RTC_INIR)
#define     rRTC_AER		(*(unsigned int volatile *)REG_RTC_AER)
#define     rRTC_FCR		(*(unsigned int volatile *)REG_RTC_FCR)
#define     rRTC_TLR		(*(unsigned int volatile *)REG_RTC_TLR)
#define     rRTC_CLR		(*(unsigned int volatile *)REG_RTC_CLR)
#define     rRTC_TSSR		(*(unsigned int volatile *)REG_RTC_TSSR)
#define     rRTC_DWR		(*(unsigned int volatile *)REG_RTC_DWR)
#define     rRTC_TAR		(*(unsigned int volatile *)REG_RTC_TAR)
#define     rRTC_CAR		(*(unsigned int volatile *)REG_RTC_CAR)
#define     rRTC_LIR		(*(unsigned int volatile *)REG_RTC_LIR)
#define     rRTC_RIER		(*(unsigned int volatile *)REG_RTC_RIER)
#define     rRTC_RIIR		(*(unsigned int volatile *)REG_RTC_RIIR)
#define     rRTC_TTR		(*(unsigned int volatile *)REG_RTC_TTR)


/*
  SmartCard Controller Registers
*/
#define     REG_SC0_RBR		(SC_BA+0x000)   /* Receive Buffer Register */
#define     REG_SC0_TBR		(SC_BA+0x000)   /* Transmit Buffer Register */
#define     REG_SC0_IER		(SC_BA+0x004)   /* Interrupt Enable Register */
#define     REG_SC0_ISR		(SC_BA+0x008)   /* Interrupt Status Register */
#define     REG_SC0_SCFR	(SC_BA+0x008)   /* FIFO Control Register */
#define     REG_SC0_BLL		(SC_BA+0x000)   /* Baud Rate Divisor Latch Reg. (LB) */
#define     REG_SC0_BLH		(SC_BA+0x004)   /* Baud Rate Divisor Latch Reg. (HB) */
#define     REG_SC0_IDR		(SC_BA+0x008)   /* Card ID Number Register */
#define     REG_SC0_CCR		(SC_BA+0x00C)   /* Card Control Register */
#define     REG_SC0_CBR		(SC_BA+0x010)   /* Clock Base Register */
#define     REG_SC0_CSR		(SC_BA+0x014)   /* Card Status Register */
#define     REG_SC0_GTR		(SC_BA+0x018)   /* Guard Time Register */
#define     REG_SC0_ECR		(SC_BA+0x01C)   /* Extended Control Register */
#define     REG_SC0_TEST	(SC_BA+0x020)   /* SC Reset Test Mode Register */
#define     REG_SC0_TOC		(SC_BA+0x028)   /* Time out Configuration Register */
#define     REG_SC0_TOIR0	(SC_BA+0x02C)   /* Time out Initial Register 0 */
#define     REG_SC0_TOIR1	(SC_BA+0x030)   /* Time out Initial Register 1 */
#define     REG_SC0_TOIR2	(SC_BA+0x034)   /* Time out Initial Register 2 */
#define     REG_SC0_TOD0	(SC_BA+0x038)   /* Time out Data Register 0 */
#define     REG_SC0_TOD1	(SC_BA+0x03C)   /* Time out Data Register 1 */
#define     REG_SC0_TOD2	(SC_BA+0x040)   /* Time out Data Register 2 */
#define     REG_SC0_BTOR	(SC_BA+0x044)   /* Buffer Time out Data Register */
#define     REG_SC1_RBR		(SC_BA+0x800)   /* Receive Buffer Register */
#define     REG_SC1_TBR		(SC_BA+0x800)   /* Transmit Buffer Register */
#define     REG_SC1_IER		(SC_BA+0x804)   /* Interrupt Enable Register */
#define     REG_SC1_ISR		(SC_BA+0x808)   /* Interrupt Status Register */
#define     REG_SC1_SCFR	(SC_BA+0x808)   /* FIFO Control Register */
#define     REG_SC1_BLL		(SC_BA+0x800)   /* Baud Rate Divisor Latch Reg. (LB) */
#define     REG_SC1_BLH		(SC_BA+0x804)   /* Baud Rate Divisor Latch Reg. (HB) */
#define     REG_SC1_IDR		(SC_BA+0x808)   /* Card ID Number Register */
#define     REG_SC1_CCR		(SC_BA+0x80C)   /* Card Control Register */
#define     REG_SC1_CBR		(SC_BA+0x810)   /* Clock Base Register */
#define     REG_SC1_CSR		(SC_BA+0x814)   /* Card Status Register */
#define     REG_SC1_GTR		(SC_BA+0x818)   /* Guard Time Register */
#define     REG_SC1_ECR		(SC_BA+0x81C)   /* Extended Control Register */
#define     REG_SC1_TEST	(SC_BA+0x820)   /* SC Reset Test Mode Register */
#define     REG_SC1_TOC		(SC_BA+0x828)   /* Time out Configuration Register */
#define     REG_SC1_TOIR0	(SC_BA+0x82C)   /* Time out Initial Register 0 */
#define     REG_SC1_TOIR1	(SC_BA+0x830)   /* Time out Initial Register 1 */
#define     REG_SC1_TOIR2	(SC_BA+0x834)   /* Time out Initial Register 2 */
#define     REG_SC1_TOD0	(SC_BA+0x838)   /* Time out Data Register 0 */
#define     REG_SC1_TOD1	(SC_BA+0x83C)   /* Time out Data Register 1 */
#define     REG_SC1_TOD2	(SC_BA+0x840)   /* Time out Data Register 2 */
#define     REG_SC1_BTOR	(SC_BA+0x844)   /* Buffer Time out Data Register */

#define     rSC0_RBR		(*(unsigned int volatile *)REG_SC0_RBR)
#define     rSC0_TBR		(*(unsigned int volatile *)REG_SC0_TBR)
#define     rSC0_IER		(*(unsigned int volatile *)REG_SC0_IER)
#define     rSC0_ISR		(*(unsigned int volatile *)REG_SC0_ISR)
#define     rSC0_SCFR		(*(unsigned int volatile *)REG_SC0_SCFR)
#define     rSC0_BLL		(*(unsigned int volatile *)REG_SC0_BLL)
#define     rSC0_BLH		(*(unsigned int volatile *)REG_SC0_BLH)
#define     rSC0_IDR		(*(unsigned int volatile *)REG_SC0_IDR)
#define     rSC0_CCR		(*(unsigned int volatile *)REG_SC0_CCR)
#define     rSC0_CBR		(*(unsigned int volatile *)REG_SC0_CBR)
#define     rSC0_CSR		(*(unsigned int volatile *)REG_SC0_CSR)
#define     rSC0_GTR		(*(unsigned int volatile *)REG_SC0_GTR)
#define     rSC0_ECR		(*(unsigned int volatile *)REG_SC0_ECR)
#define     rSC0_TEST		(*(unsigned int volatile *)REG_SC0_TEST)
#define     rSC0_TOC		(*(unsigned int volatile *)REG_SC0_TOC)
#define     rSC0_TOIR0		(*(unsigned int volatile *)REG_SC0_TOIR0)
#define     rSC0_TOIR1		(*(unsigned int volatile *)REG_SC0_TOIR1)
#define     rSC0_TOIR2		(*(unsigned int volatile *)REG_SC0_TOIR2)
#define     rSC0_TOD0		(*(unsigned int volatile *)REG_SC0_TOD0)
#define     rSC0_TOD1		(*(unsigned int volatile *)REG_SC0_TOD1)
#define     rSC0_TOD2		(*(unsigned int volatile *)REG_SC0_TOD2)
#define     rSC0_BTOR		(*(unsigned int volatile *)REG_SC0_BTOR)
#define     rSC1_RBR		(*(unsigned int volatile *)REG_SC1_RBR)
#define     rSC1_TBR		(*(unsigned int volatile *)REG_SC1_TBR)
#define     rSC1_IER		(*(unsigned int volatile *)REG_SC1_IER)
#define     rSC1_ISR		(*(unsigned int volatile *)REG_SC1_ISR)
#define     rSC1_SCFR		(*(unsigned int volatile *)REG_SC1_SCFR)
#define     rSC1_BLL		(*(unsigned int volatile *)REG_SC1_BLL)
#define     rSC1_BLH		(*(unsigned int volatile *)REG_SC1_BLH)
#define     rSC1_IDR		(*(unsigned int volatile *)REG_SC1_IDR)
#define     rSC1_CCR		(*(unsigned int volatile *)REG_SC1_CCR)
#define     rSC1_CBR		(*(unsigned int volatile *)REG_SC1_CBR)
#define     rSC1_CSR		(*(unsigned int volatile *)REG_SC1_CSR)
#define     rSC1_GTR		(*(unsigned int volatile *)REG_SC1_GTR)
#define     rSC1_ECR		(*(unsigned int volatile *)REG_SC1_ECR)
#define     rSC1_TEST		(*(unsigned int volatile *)REG_SC1_TEST)
#define     rSC1_TOC		(*(unsigned int volatile *)REG_SC1_TOC)
#define     rSC1_TOIR0		(*(unsigned int volatile *)REG_SC1_TOIR0)
#define     rSC1_TOIR1		(*(unsigned int volatile *)REG_SC1_TOIR1)
#define     rSC1_TOIR2		(*(unsigned int volatile *)REG_SC1_TOIR2)
#define     rSC1_TOD0		(*(unsigned int volatile *)REG_SC1_TOD0)
#define     rSC1_TOD1		(*(unsigned int volatile *)REG_SC1_TOD1)
#define     rSC1_TOD2		(*(unsigned int volatile *)REG_SC1_TOD2)
#define     rSC1_BTOR		(*(unsigned int volatile *)REG_SC1_BTOR)


