Xiaomian6/NUC951-Four_digit_calculator/lib/NUC900_reg.h
/*
  PS2 Control Registers
*/
#define     REG_PS2_CMD0		(PS2_BA+0x000)  /* PS2 port 0 Host Controller Command Register */
#define     REG_PS2_STS0		(PS2_BA+0x004)  /* PS2 port 0 Host Controller Status Register */
#define     REG_PS2_SCANCODE0	(PS2_BA+0x008)  /* PS2 port 0 Host Controller Rx Scan Code Register */
#define     REG_PS2_ASCII0		(PS2_BA+0x00C)  /* PS2 port 0 Host Controller Rx ASCII Code */
#define     REG_PS2_CMD1		(PS2_BA+0x100)  /* PS2 port 1 Host Controller Command Register */
#define     REG_PS2_STS1		(PS2_BA+0x104)  /* PS2 port 1 Host Controller Status Register */
#define     REG_PS2_SCANCODE1	(PS2_BA+0x108)  /* PS2 port 1 Host Controller Rx Scan Code Register */
#define     REG_PS2_ASCII1		(PS2_BA+0x10C)  /* PS2 port 1 Host Controller Rx ASCII Code */
 
#define     rPS2_CMD0			(*(unsigned int volatile *)REG_PS2_CMD0)
#define     rPS2_STS0			(*(unsigned int volatile *)REG_PS2_STS0)
#define     rPS2_SCANCODE0		(*(unsigned int volatile *)REG_PS2_SCANCODE0)
#define     rPS2_ASCII0			(*(unsigned int volatile *)REG_PS2_ASCII0)
#define     rPS2_CMD1			(*(unsigned int volatile *)REG_PS2_CMD1)
#define     rPS2_STS1			(*(unsigned int volatile *)REG_PS2_STS1)
#define     rPS2_SCANCODE1		(*(unsigned int volatile *)REG_PS2_SCANCODE1)
#define     rPS2_ASCII1			(*(unsigned int volatile *)REG_PS2_ASCII1)
 
 
/*
  ADC Control Registers
*/
#define     REG_ADC_CON		(ADC_BA+0x00)  /* ADC control register */
#define     REG_ADC_TSC		(ADC_BA+0x04)  /* Touch screen control register */
#define     REG_ADC_DLY		(ADC_BA+0x08)  /* ADC delay register */
#define     REG_ADC_XDATA	(ADC_BA+0x0C)  /* ADC XDATA register */
#define     REG_ADC_YDATA	(ADC_BA+0x10)  /* ADC YDATA register */
#define     REG_ADC_LV_CON	(ADC_BA+0x14)  /* Low Voltage Detector Control register */
#define     REG_ADC_LV_STS	(ADC_BA+0x18)  /* Low Voltage Detector Status register */

#define     rADC_CON		(*(unsigned int volatile *)REG_ADC_CON)
#define     rADC_TSC		(*(unsigned int volatile *)REG_ADC_TSC)
#define     rADC_DLY		(*(unsigned int volatile *)REG_ADC_DLY)
#define     rADC_XDATA		(*(unsigned int volatile *)REG_ADC_XDATA)
#define     rADC_YDATA		(*(unsigned int volatile *)REG_ADC_YDATA)
#define     rADC_LV_CON		(*(unsigned int volatile *)REG_ADC_LV_CON)
#define     rADC_LV_STS		(*(unsigned int volatile *)REG_ADC_LV_STS)

#endif /* _NUC900_H */